## Plan Result (Prod)




<pre><code>Plan: 3 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * module.prod-apps.azurerm_dns_a_record.this[&#34;libra-gateway&#34;]
  * module.prod-apps.azurerm_dns_zone.zone
  * module.prod-apps.azurerm_role_assignment.dnszonecontributer
* Update
  * module.apply-divorce.azurerm_dns_txt_record.this[&#34;_dnsauth.www&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_b5ad23a3b52771815f77a4c7a85e6345.wfmapp&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.preprod&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.training&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.apply-divorce.azurerm_dns_txt_record.this["_dnsauth.www"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "5bz95ky3c27gb6475yz0yx2x1g4wg6qc"
        }
    }

  # module.ctsc-hmcts.azurerm_dns_cname_record.this["_b5ad23a3b52771815f77a4c7a85e6345.wfmapp"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/ctsc.hmcts.net/CNAME/_b5ad23a3b52771815f77a4c7a85e6345.wfmapp"
        name                = "_b5ad23a3b52771815f77a4c7a85e6345.wfmapp"
      ~ record              = "DBB483EBD37876263819222CEE3CD694.ECECD324B9EF785188CC31B79E103A02.c11436178b6f4613b928.sectigo.com." -> "DBB483EBD37876263819222CEE3CD694.ECECD324B9EF785188CC31B79E103A02.9f5f53f37396a3c5c13d.sectigo.com."
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.ctsc-hmcts.azurerm_dns_cname_record.this["_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.preprod"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/ctsc.hmcts.net/CNAME/_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.preprod"
        name                = "_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.preprod"
      ~ record              = "603D81996C47863EDFE41A6ED2EF3224.A1363BE712CA02F75C3C5259EC7D4680.9b1211e0578d0fbcf7ab.sectigo.com." -> "603D81996C47863EDFE41A6ED2EF3224.A1363BE712CA02F75C3C5259EC7D4680.586ee5cb5f17541372cd.sectigo.com."
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.ctsc-hmcts.azurerm_dns_cname_record.this["_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.training"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/ctsc.hmcts.net/CNAME/_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.training"
        name                = "_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.training"
      ~ record              = "603D81996C47863EDFE41A6ED2EF3224.A1363BE712CA02F75C3C5259EC7D4680.9b1211e0578d0fbcf7ab.sectigo.com." -> "603D81996C47863EDFE41A6ED2EF3224.A1363BE712CA02F75C3C5259EC7D4680.586ee5cb5f17541372cd.sectigo.com."
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.prod-apps.azurerm_dns_a_record.this["libra-gateway"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "libra-gateway"
      + records             = [
          + "185.230.153.229",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "prod.apps.hmcts.net"
    }

  # module.prod-apps.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "prod.apps.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"
    }

  # module.prod-apps.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1430,"Program":"tfcmt","SHA1":"","Target":"Prod","Vars":{}} -->